// 民族数据
export const nationalityData = [
  '汉族',
  '蒙古族',
  '回族',
  '藏族',
  '维吾尔族',
  '苗族',
  '彝族',
  '壮族',
  '布依族',
  '朝鲜族',
  '满族',
  '侗族',
  '瑶族',
  '白族',
  '土家族',
  '哈尼族',
  '哈萨克族',
  '傣族',
  '黎族',
  '僳僳族',
  '佤族',
  '畲族',
  '高山族',
  '拉祜族',
  '水族',
  '东乡族',
  '纳西族',
  '景颇族',
  '柯尔克孜族',
  '土族',
  '达斡尔族',
  '仫佬族',
  '羌族',
  '布朗族',
  '撒拉族',
  '毛南族',
  '仡佬族',
  '锡伯族',
  '阿昌族',
  '普米族',
  '塔吉克族',
  '怒族',
  '乌孜别克族',
  '俄罗斯族',
  '鄂温克族',
  '德昂族',
  '保安族',
  '裕固族',
  '京族',
  '塔塔尔族',
  '独龙族',
  '鄂伦春族',
  '赫哲族',
  '门巴族',
  '珞巴族',
  '基诺族'
]
// 政治面貌
export const politicsStatusData = [
  '群众',
  '中共党员',
  '中共预备党员',
  '其他民主党派',
  '无党派人士'
]
// 宗教信仰
export const religionData = [
  '佛教',
  '道教',
  '基督教',
  '天主教',
  '伊斯兰教',
  '其他'
]
// 婚姻状况
export const maritalStatusData = ['已婚', '丧偶', '未婚', '离婚', '再婚']
// 文化程度
export const degreeEducationData = [
  '文盲',
  '小学',
  '初中',
  '高中',
  '中专',
  '大专',
  '本科',
  '硕士',
  '博士'
]
// 经济来源
export const sourceFinanceData = [
  '退休金',
  '子女补贴',
  '亲友资助',
  '政府补助',
  '其他'
]
// 医疗保障
export const safeguardData = ['城镇职工基本医疗保险', '城乡居民基本医疗保险']
// 疾病诊断
export const diseaseDiagnosisData = [
  // {
  //   value: 0,
  //   label: '无疾病'
  // },
  // {
  //   value: 1,
  //   label: '冠心病I25.1'
  // },
  // {
  //   value: 2,
  //   label: '糖尿病E10-E14'
  // }
  '无疾病',
  '冠心病I25.1',
  '糖尿病E10-E14',
  '肺炎J14',
  '高血压I10',
  '癫痫G40',
  '艾滋病B2',
  '慢性肾功能衰竭N18-N19',
  '脑出血I60-I62',
  '脑梗塞I63',
  '尿路感染',
  '帕金森综合症G20-G22',
  '消化道出血K20-K31',
  '肿瘤C00-D48',
  '截肢（6个月内）',
  '骨折（3个月内）'
  // '其他'
]
// 伤口情况
export const woundStatusData = [
  '无',
  '擦伤',
  '烧烫伤',
  '术后伤口',
  '糖尿病足溃疡',
  '血管性溃疡',
  '其他伤口'
]
// 特殊医疗照护情况
export const specialStatusData = [
  '无',
  '胃管',
  '尿管',
  '气管切开',
  '无创呼吸机',
  '透析',
  '胃/肠/膀胱造痿',
  '其他'
]
// 风险事件
export const riskData = ['无', '发生过1次', '发生过2次', '发生过3次以上']
// 自理能力
export const selfCareAbilityData = [
  '不能自理',
  '轻度依赖',
  '中度依赖',
  '可自理'
]
// 痴呆前兆
export const sdementiaData = [
  '行为异常',
  '记忆障碍',
  '日常生活能力减退',
  '呆坐'
]

// 能力评估
export const assessmentData = [
  'A. 独立完成，不需要协助',
  'B. 在他人语言指导或照看下完成',
  'C. 需要他人协助，但以自身完成为主',
  'D. 主要依靠协助，自身能予配合',
  'E. 完全依赖他人协助，且无法给予配合'
]
export const assessmentData4 = [
  'A. 时间观念（年、月、日、时）和空间清楚；可单独出远门，能很快掌握新环境的方位',
  'B. 时间观念有些下降，年、月、日清楚，但有时相差几天；可单独来往于近街，知道现住地的名称和方位，但不知回家路线',
  'C. 时间观念较差，年、月、日不清楚，可知上半年或下半年；只能单独在家附近行动，对现住地只知名称，不知道方位',
  'D. 时间观念很差，年、月、日不清楚，可知上午或下午；只能在左邻右舍间串门，对现住地不知名称和方位',
  'E. 无时间观念；不能单独外出'
]
export const assessmentData5 = [
  'A. 知道周围人们的关系，知道祖孙、叔伯、姑姨、侄子侄女等称谓的意义；可分辨陌生人的大致年龄和身份，可用适当称呼',
  'B. 只知家中亲密近亲的关系，不会分辨陌生人的大致年龄，不能称呼陌生人',
  'C. 只能称呼家中人，或只能照样称呼，不知其关系，不辨辈分',
  'D. 只认识常同住的亲人，可称呼子女或孙子女，可辨熟人和生人',
  'E. 只认识主要照顾者，不辨熟人和生人'
]
export const assessmentData6 = [
  'A. 总是能够保持与社会、年龄所适应的长、短时记忆，能够完整的回忆',
  'B. 出现轻度的记忆紊乱或回忆不能（不能回忆即时信息，3个词语经过5分钟后仅能回忆0-1个）',
  'C. 出现中度的记忆紊乱或回忆不能（不能回忆近期记忆，不记得上一顿饭吃了什么）',
  'D. 出现重度的记忆紊乱或回忆不能（不能回忆远期记忆，不记得自己老朋友）',
  'E. 记忆完全紊乱或者完全不能对既往事务进行正确的回忆'
]
export const assessmentData7 = [
  'A：视力正常',
  'B：能看清楚大字体，但看不清书报上的标准字体',
  'C：视力有限，看不清报纸大标题，但能辨认物体',
  'D：只能看到光、颜色和形状',
  'E：完全失明'
]
export const assessmentData8 = [
  'A：听力正常',
  'B：在轻声说话或说话距离超过2米时听不清',
  'C：正常交流有些困难，需在安静的环境或大声说话才能听到',
  'D：讲话者大声说话或说话很慢，才能部分听见',
  'E：完全失聪'
]
export const assessmentData9 = [
  'A：个体能够完全独立计划、安排和完成日常事务，包括但不限于洗衣服、小金额购物、服药管理， 无需协助',
  'B：个体在计划、安排和完成日常事务需要他人监护或指导',
  'C：个体在计划、安排和完成日常事务需要小量协助',
  'D：个体在计划、安排和完成日常事务需要大量协助',
  'E：个体完全依赖他人进行日常事务'
]
export const assessmentData10 = [
  'A：能自己骑车或搭乘公共交通工具外出',
  'B：能自己搭乘出租车，但不会搭乘公共交通工具外出',
  'C：当有人协助或陪伴，可搭乘公共交通工具外出',
  'D：只能在别人协助下搭乘出租车或私家车外出',
  'E：完全不能出门，或者外出完全需要协助'
]
export const gradeResultData = [
  '已诊断疾病超过3项',
  '风险事件超过3次',
  '长期处于昏迷状态',
  '认知障碍/痴呆',
  '精神类疾病'
]
export const gradeAbilityData = [
  '能力完好',
  '轻度失能',
  '中度失能',
  '中重度失能',
  '重度失能'
]
